Revit 2026 API

# IFCImportOptions Properties

---

The IFCImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Action | The action of the import. |
|  | AutocorrectOffAxisLines | Enable or disable correcting lines that are slight off-axis. |
|  | AutoJoin | Enable or disable auto-join at the end of import. |
|  | CreateLinkInstanceOnly | Determines whether to create a linked symbol element or not. |
|  | ForceImport | Force the IFC file to be imported regardless of an existing corresponding Revit file. |
|  | Intent | The intent of the import. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LinkOrientation | The orientation of the Linked IFC File in the Host Document. |
|  | LinkPosition | The position of the Linked IFC File in the Host Document. |
|  | RevitLinkFileName | The full path of the intermediate Revit file created during a previous link action. This is used during "Reload From" to determine the path to the previous generated Revit file. |

#### Reference

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace